---
kind: method
id: M:Autodesk.Revit.DB.PaperSizeSet.#ctor
source: html/e96a21b6-415a-4575-0c76-43be58f7d4c4.htm
---
# Autodesk.Revit.DB.PaperSizeSet.#ctor Method

Initializes a new instance of the PaperSizeSet class

## Syntax (C#)
```csharp
public PaperSizeSet()
```